#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
[0m[1mmodule.cloudflare_lilja_io_setup.data.cloudflare_zone.lilja_dot_io: Reading...[0m[0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_protomain_verification: Refreshing state... [id=5a64b437361c0d87c612affbabf5a1b5][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"]: Refreshing state... [id=39a68ea4e94f07561df0332d40e1b58b][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.txt_dmarc: Refreshing state... [id=a8e709d83e8eb264c9efb249b6b7840a][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"]: Refreshing state... [id=46d7a5f73307bd1c5c754c566c64b8e4][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"]: Refreshing state... [id=11089f2eb48f12459120121b9509684c][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_spf1: Refreshing state... [id=63d176ec8068198506fb92d83af88bee][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"]: Refreshing state... [id=870c69315aba7c377a062307e01a17fc][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"]: Refreshing state... [id=d84a8273fb7e349226026d9960ed5ab4][0m
[0m[1mmodule.cloudflare_lilja_io_setup.data.cloudflare_zone.lilja_dot_io: Read complete after 0s [id=801ec7bc35b2abc9580d847c7b5c6f56][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "protonmail._domainkey"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "protonmail2._domainkey"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "protonmail3._domainkey"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m comment         = "MX records for lilja.io zone."
      [32m+[0m[0m content         = "mail.protonmail.ch"
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "lilja.io"
      [32m+[0m[0m priority        = 1
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = 1
      [32m+[0m[0m type            = "MX"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m comment         = "MX records for lilja.io zone."
      [32m+[0m[0m content         = "mailsec.protonmail.ch"
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "lilja.io"
      [32m+[0m[0m priority        = 2
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = 1
      [32m+[0m[0m type            = "MX"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification[0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "mx_proton_protomain_verification" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = (sensitive value)
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "lilja.io"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "TXT"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1[0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "mx_proton_spf1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "v=spf1 include:_spf.protonmail.ch mx ~all"
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "lilja.io"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "TXT"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc[0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "txt_dmarc" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "v=DMARC1; p=quarantine"
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "_dmarc"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "TXT"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"][0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.cname_dkim1 is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2025-02-01T14:44:22.97234Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "protonmail._domainkey.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "46d7a5f73307bd1c5c754c566c64b8e4" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2025-02-01T14:44:22.97234Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "protonmail._domainkey" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = true [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "CNAME" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"][0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.cname_dkim1 is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2025-02-01T14:44:23.459029Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "protonmail2._domainkey.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "11089f2eb48f12459120121b9509684c" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2025-02-01T14:44:23.459029Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "protonmail2._domainkey" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = true [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "CNAME" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"][0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.cname_dkim1 is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2025-02-01T14:44:22.719372Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "protonmail3._domainkey.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "870c69315aba7c377a062307e01a17fc" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2025-02-01T14:44:22.719372Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "protonmail3._domainkey" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = true [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "CNAME" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"][0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.mx_proton_mail is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m comment         = "MX records for lilja.io zone." [90m-> null[0m[0m
      [31m-[0m[0m content         = "mail.protonmail.ch" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2025-02-01T14:44:23.974226Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "39a68ea4e94f07561df0332d40e1b58b" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2025-02-01T14:44:23.974226Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m priority        = 1 [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "MX" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"][0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.mx_proton_mail is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m comment         = "MX records for lilja.io zone." [90m-> null[0m[0m
      [31m-[0m[0m content         = "mailsec.protonmail.ch" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2025-02-01T14:44:23.220929Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "d84a8273fb7e349226026d9960ed5ab4" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2025-02-01T14:44:23.220929Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m priority        = 2 [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "MX" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_protomain_verification[0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.mx_proton_protomain_verification is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "mx_proton_protomain_verification" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m content         = (sensitive value) [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:49.268193Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "5a64b437361c0d87c612affbabf5a1b5" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:49.268193Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "TXT" [90m-> null[0m[0m
      [31m-[0m[0m value           = "protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_spf1[0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.mx_proton_spf1 is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "mx_proton_spf1" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m content         = "v=spf1 include:_spf.protonmail.ch mx ~all" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:49.464628Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "63d176ec8068198506fb92d83af88bee" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:49.464628Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "TXT" [90m-> null[0m[0m
      [31m-[0m[0m value           = "v=spf1 include:_spf.protonmail.ch mx ~all" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.txt_dmarc[0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.txt_dmarc is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "txt_dmarc" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m content         = "v=DMARC1; p=quarantine" [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2024-03-07T21:40:14.581184Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "_dmarc.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "a8e709d83e8eb264c9efb249b6b7840a" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2024-03-07T21:40:14.581184Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "_dmarc" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "TXT" [90m-> null[0m[0m
      [31m-[0m[0m value           = "v=DMARC1; p=quarantine" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1mPlan:[0m 8 to add, 0 to change, 8 to destroy.
[0m```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*